app/views/books/show.html.erb

                   <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
                   <%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

                   <i class="fa fa-heart-o" aria-hidden="true"></i>
                   <%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]


                <td><i class="fa fa-comment-o" aria-hidden="true"></i><%= @book.book_comments.count %></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]