app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "これはいいですね！！！"], ["user_id", 2], ["book_id", 2], ["created_at", "2020-08-06 12:15:12.393481"], ["updated_at", "2020-08-06 12:15:12.393481"]]
---
  def create
  	book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = book.id
    comment.save