app/controllers/books_controller.rb

  def create
  	@book_new = Book.new(book_params)
    @books = Book.all
    @book_new.user_id = current_user.id
    if @book_new.save
---
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "アルゴリズム図解!!"], ["body", "アルゴリズムを図解！！"], ["user_id", 1], ["created_at", "2020-08-06 12:10:10.706406"], ["updated_at", "2020-08-06 12:10:10.706406"]]

  def show
    @book_new = Book.new
  	@book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]