app/controllers/relationships_controller.rb

	def create
    @user = User.find(params[:relationship][:following_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def destroy
    @user = Relationship.find(params[:id]).following
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]