app/controllers/users_controller.rb

  def update
     @user = User.find(params[:id])
     if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "よろしくです！！！"], ["profile_image_id", "df6a53dd416cedca0232a8bd547ba438ea24bff08fdbabce62a5391381c4"], ["updated_at", "2020-08-06 12:11:38.099657"], ["id", 1]]

  def following
      @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def followers
    @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]